examples/phtEnthalpyFoam/2DlocalHeatSource/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    "openBorder.*"
    {
    //    type            fixedValue;
    //    value           uniform (0 1 0);
	  type         fluxCorrectedVelocity;
    }

/*    openBorder2
    {
	    type         fluxCorrectedVelocity;
    }*/

    walls
    {
        type           surfaceNormalFixedValue;
        refValue       uniform 0;
    }

    symm
    {
        type            symmetryPlane;
    }
	
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
